Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་སའི་ལྷ་མོ་བརྟན་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། སའི་ལྷ་མོ་བརྟན་མ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། སའི་ལྷ་མོ་བརྟན་མའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སའི་ལྷ་མོ་བརྟན་མའི་གདམས་ངག་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the earth goddess Sthāvarā, circumambulated the earth goddess Sthāvarā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the earth goddess Sthāvarā.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་དེ་རབ་ཏུ་གོམས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་ཚུལ་དེའི་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པས་རྣམ་པར་རྩེ་བ་དེ་ལ་རྣམ་པར་དཔྱད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་ཤིན་ཏུ་ཕྲ་བ་དེ་ལ་རྣམ་པར་བལྟ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་རྒྱ་མཚོ་དེ་ལ་འཇུག་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་ཐ་དད་པ་དེ་ལ་ཡིད་ཆེས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་ཤིན་ཏུ་སྦྱང་བ་དེ་རྗེས་སུ་རྟོགས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་རྒྱ་མཚོ་དེ་ལ་འབབ་པར་བྱ་བ་བྱེད་ཅིང་།
en: Vāsantī Chapter 34 Sudhana, the head merchant’s son, remembering the teaching of the earth goddess Sthāvarā, remembering the bodhisattva liberation called the essence of invincible wisdom, becoming adept in the meditation of bodhisattva samādhi, contemplating the way of the bodhisattva Dharma, analyzing the displays of bodhisattva liberation, viewing the very subtle wisdom of bodhisattva liberation, entering the ocean of the wisdom of bodhisattva liberation, with faith in the different wisdoms of bodhisattva liberation, realizing the mastery of the wisdom of bodhisattva liberation, and descending into the ocean of the wisdom of bodhisattva liberation, arrived at the location of the town of Kapilavastu.

source: གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་གང་ན་བ་དེར་ཕྱིན་ཏེ། གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་ནས། ཤར་ཕྱོགས་ལོགས་ཀྱི་གྲོང་ཁྱེར་གྱི་སྒོ་ནས་སོང་སྟེ། ཉི་མ་ནུབ་ནས་རིང་པོ་མ་ལོན་པ་ཞིག་ཏུ་གྲོང་ཁྱེར་གྱི་ལམ་གྱི་སུམ་མདོའི་དབུས་ཤིག་ན། བྱང་ཆུབ་སེམས་དཔའི་གདམས་ངག་མཐུན་པར་ལེན་པ་དེ་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་མཐོང་བར་འདོད་ཅིང་། དགེ་བའི་བཤེས་གཉེན་ཡོད་ན་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་བར་ངེས་པའི་བློ་གྲོས་དང་ལྡན་པ། ཡེ་ཤེས་ཀྱི་མིག་ཀུན་ཏུ་ལྟ་བའི་ཡུལ་གྱི་རང་བཞིན་གྱི་བྱིན་གྱི་རླབས་དང་ལྡན་པ། ཕྱོགས་ཐམས་ཅད་དུ་མངོན་པར་གཞོལ་ཞིང་།
en: He circumambulated the town of Kapilavastu, keeping it to his right, and entered the town through its eastern gate.

source: དགེ་བའི་བཤེས་གཉེན་ལ་བལྟ་བའི་སེམས་ཀྱིས་མོས་པ་དང་། ཡེ་ཤེས་ཆེན་པོའི་སྙིང་པོར་གྱུར་པའི་འདུ་ཤེས་ཀྱི་སེམས་དང་ལྡན་པ། དམིགས་པ་ཐམས་ཅད་ལ་རབ་ཏུ་ཞུགས་པའི་ཡེ་ཤེས་ཀྱི་མིག་དང་ལྡན་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཐམས་ཅད་དུ་ཡེ་ཤེས་རྒྱ་མཚོ་འབྱམ་ཀླས་པས་རྒྱས་པར་འགེངས་པ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱི་མིག་གིས་ཕྱོགས་ཐམས་ཅད་དུ་ཤེས་བྱའི་རྒྱ་མཚོ་ལ་རྣམ་པར་ལྟ་བ། ཡེ་ཤེས་ཆེན་པོའི་མིག་འཐོབ་པར་བྱ་བ་ལ་རབ་ཏུ་གཞོལ་ཞིང་བསམ་པ་རྩེ་གཅིག་ཏུ་བཞག་ནས་འདུག་པ་དང་།
en: He stayed at the town’s central junction of three streets, where, soon after sunset, wishing to see Vāsantī, the goddess of the night, while reverentially following the bodhisattva teaching, having the definite understanding that the wisdom of buddhahood is attained through kalyāṇamitras, having the blessing of the scope of the view of the eyes of wisdom, facing every direction with the aspiration to see the kalyāṇamitra, with a mind that perceives the essence of great wisdom, with eyes of wisdom that engage with all objects of perception, with eyes of samādhi that pervade the vast extent of the ocean of the wisdom of all the ways of the realm of phenomena, seeing the ocean of all that is to be known in all directions, with a single-pointed mind intent on attaining the eyes of wisdom resting with one-pointed thought, he saw Vāsantī, the goddess of the night, in the realm of space above the great town of Kapilavastu.

source: མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་དེ་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་ཀྱི་སྟེང་གི་ནམ་མཁའི་དབྱིངས་ལས་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་དཔེ་མེད་པའི་ཁང་པ་བརྩེགས་པ་ཞིག་ན།
en: She was in a kūṭāgāra of various precious jewels beyond compare.

source: རིན་པོ་ཆེའི་སེང་གེའི་ཁྲི་ཆེན་པོ་སྤོས་ཞིམ་པོ་ཐམས་ཅད་ཀྱི་པདྨོའི་སྙིང་པོ་ཅན་ཞིག་ལ་ལུས་ཀྱི་མདོག་གསེར་གྱི་ཁ་དོག་ཏུ་འདུག་པ།
en: She was seated upon a lotus that had every excellent aroma, in the center of a great precious lion throne. Her body was the color of gold.

source: སྐྲ་འཇམ་ཞིང་མང་ལ་མཐོན་ཏིང་དུ་འདུག་པ།
en: Her hair was soft, abundant, and deep black.

source: མིག་དཀར་ནག་འབྱེས་པ།
en: Her eyes were deep black.

source: གཟུགས་བཟང་ཞིང་མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: She was beautiful, attractive, and lovely to the sight.

source: ལུས་རྒྱན་དང་ལྷབ་ལྷུབ་ཐམས་ཅད་ཀྱིས་ཀླུབས་ཤིང་བརྒྱན་པ།
en: Her body was beautified by all jewelry and adornments. She was wearing dyed clothing.

source: ཁ་དོག་བསྒྱུར་བའི་གོས་བགོས་པ་ཚངས་པའི་གཙུག་ཏོར་གྱི་ཅོད་པན་ཟླ་བའི་དཀྱིལ་འཁོར་གྱིས་བརྒྱན་པ་ཐོགས་པ་ལུས་ལ་རྒྱུ་སྐར་དང་།
en: She possessed a sacred topknot adorned by the disk of the moon as a crest.

source: གཟའ་དང་སྐར་ཆེན་དང་། སྐར་མའི་ཚོགས་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་སྣང་བར་གྱུར་བ་འདུག་པ་མཐོང་ངོ་། །
en: The constellations, the planets, and all the stars appeared in her body.

source: དེས་སེམས་ཅན་གྱི་ཁམས་ཡངས་པར་མི་ཁོམ་པ་དང་། ངན་སོང་དང་། ངན་འགྲོ་དང་། ལོག་པར་ལྟུང་བ་ནས་སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོངས་སུ་བགྲོལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་དེའི་བ་སྤུའི་སྦུབས་སུ་ཆུད་པར་མཐོང་ངོ་། །
en: He saw within her pores all the beings she had liberated who in the vast realm of beings had fallen into inopportune states, lower existences, and lower realms.

source: ཇི་སྙེད་ཅིག་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་བཀོད་པ་དང་། ཇི་སྙེད་ཅིག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ། དེ་དག་ཐམས་ཅད་ཀྱང་དེའི་བ་སྤུའི་སྦུབས་སུ་ཆུད་པར་མཐོང་ངོ་། །
en: He saw within her pores all those she had brought to the higher realms, all those she had ripened for the enlightenment of the śrāvakas and pratyeka­buddhas, and those she had ripened for omniscience.

source: ལུས་མངོན་པར་བསྒྲུབ་པ་དང་། གཟུགས་མངོན་པར་བསྒྲུབ་པ་དང་། ཁ་དོག་མངོན་པར་བསྒྲུབ་པའི་ཐབས་སྣ་ཚོགས་ཀྱིས་ཇི་སྙེད་ཅིག་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ་དེ་དག་ཀྱང་དེའི་བ་སྤུའི་སྦུབས་སུ་ཆུད་པར་མཐོང་ངོ་། །ང་རོ་མངོན་པར་བསྒྲུབ་པ་དང་།
en: He saw within her pores all her created bodies, created forms, and created colors that were her various methods that ripened beings.

source: དབྱངས་ཀྱི་ཡན་ལག་མངོན་པར་བསྒྲུབ་པ་དང་། སྐད་ཀྱི་ཚུལ་སྣ་ཚོགས་ཡོངས་སུ་སྦྱར་བ་ཇི་སྙེད་ཅིག་གིས་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ་དེ་དག་ཀྱང་། དེའི་བ་སྤུའི་སྒོ་ནས་རྗེས་སུ་བརྗོད་པ་ཐོས་སོ། །དུས་མངོན་པར་བསྒྲུབ་པ་དང་། བསམ་པ་དང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གནོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པའི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་སྤྱོད་པ་དང་།
en: He heard sounding from her pores the creation of sounds, the creation of the aspects of the voice, and their application to the various ways of speech through which she ripened beings.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་ལྟ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ལྟ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱེས་བུ་སེང་གེ་ཆེན་པོའི་རྣམ་པར་བསྒྱིངས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པས།
en: He perceived within her pores her creation of times, her bodhisattva conduct, her bodhisattva prowess, her entrances to bodhisattva samādhis and transformations, her bodhisattva power of leadership, her bodhisattva states of being, her bodhisattva view, her bodhisattva observation, her bodhisattva emanations, her bodhisattva lion-like awesomeness of a great being, and her displays of bodhisattva liberation through which she ripened beings in accordance with their motivations and aspirations.

source: རྣམ་པར་རྩེ་བ་ཇི་སྙེད་ཅིག་གིས་དེས་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ་དེ་དག་ཀྱང་། དེའི་བ་སྤུའི་སྦུབས་སུ་ཆུད་པར་མཐོང་ངོ་། །དེས་ཐབས་སྣ་ཚོགས་དང་ལྡན་པའི་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དེ་དག་མཐོང་ཞིང་ཐོས་ནས་དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: He saw and heard an ocean of the ways of the Dharma that employed various methods, and he was satisfied, joyful, pleased, delighted, content, and happy.

source: མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་དེ་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་ནས་ཕྱག་འཚལ་ཏེ། ལངས་ནས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པའི་མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: He prostrated to the night goddess Vāsantī with the full length of his body, got up, and circumambulated the night goddess Vāsantī, keeping her to his right, many hundreds of thousands of times.

source: ལྷ་མོ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ་དེ་ལྟར་བདག་གིས་དགེ་བའི་བཤེས་གཉེན་གྱི་བྱིན་གྱི་རླབས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་འབྱུང་བར་ཡང་དག་པར་མཐོང་པས།
en: Then he stood before her and, with his hands placed together in homage, said, “Goddess, I have developed the aspiration for the highest, complete enlightenment. I have seen that all the qualities of buddhahood arise through the blessing of a kalyāṇamitra.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཕྱག་ཏུ་བདག་ཉིད་བོར་བ་ལགས་ན།
en: I put myself in the hands of the kalyāṇamitra.

source: ལྷ་མོ་ཤུལ་གང་ལ་བརྟེན་ན། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་བཅུའི་སར་འབྱུང་བར་འགྱུར་བའི་ཐམས་ཅད་མཁྱེན་པའི་ཤུལ་བདག་ལ་བཤད་དུ་གསོལ། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Show me, goddess, the path to omniscience upon which a bodhisattva will bring forth the ten strengths.”

source: མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་དགེ་བའི་བཤེས་གཉེན་ཀྱི་སྦྱིན་གྱིས་ནོན་ཏེ། དགེ་བའི་བཤེས་གཉེན་ཀྱི་ཚིག་མཉན་པར་འདོད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་དག་ལ་ནན་ཏན་དུ་བྱེད་པའི་ལེགས་སོ་ལེགས་སོ། །
en: The night goddess Vāsantī said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you are thus in awe of kalyāṇamitras and wish to hear a kalyāṇamitra’s words and practice the teaching of kalyāṇamitras.

source: རིགས་ཀྱི་བུ་ཁྱོད་དེ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ནན་ཏན་དུ་བྱེད་པས། གདོན་མི་ཟ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་འགྱུར་རོ། །
en: “Noble one, through thus practicing the teaching of the kalyāṇamitras, you will, without a doubt, approach the highest, complete enlightenment.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྣང་བས་འགྲོ་བ་རྣམ་པར་འདུལ་བའི་སྒོ་ཐོབ་པ་སྟེ།
en: “Noble one, I have attained the bodhisattva liberation called the gateway to guiding beings through the radiance of the Dharma that eliminates the darkness of all beings.

source: བསམ་པ་མི་མཉམ་པ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་བྱམས་པའི་སེམས་དང་ལྡན་པའོ། །
en: My mind has love for beings who have unstable minds.

source: མི་དགེ་བའི་ལས་ཀྱི་ལམ་ལ་ཞུགས་པ་རྣམས་ལ་སྙིང་རྗེའི་སེམས་དང་ལྡན་པའོ། །
en: My mind has compassion for beings who follow the path of nonvirtuous actions.

source: དགེ་བའི་ལས་ཀྱི་ལམ་ལ་ཞུགས་པ་རྣམས་ལ་དགའ་བའི་སེམས་དང་ལྡན་པའོ། །
en: My mind rejoices in those who follow the path of virtuous actions.

source: སེམས་མཉམ་པར་དང་མི་མཉམ་པར་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་མི་གཉིས་པའི་སེམས་དང་ལྡན་པའོ། །
en: My mind does not discriminate between beings with stable and unstable minds.

source: ཀུན་ནས་ཉོན་མོངས་བ་རྣམས་ལ་རྣམ་པར་བྱང་བའི་སེམས་དང་ལྡན་པའོ། །
en: My motivation is to purify those afflicted by the kleśas.

source: ཉམ་ང་བར་གྱུར་པ་རྣམས་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་དང་ལྡན་པའོ། །
en: My motivation is to bring the pitiful to perfection.

source: དམའ་བ་ལ་མོས་པ་རྣམས་ལ་ཡངས་པ་ལ་མོས་པ་ཡོངས་སུ་བསྐྱེད་པའི་སེམས་དང་ལྡན་པའོ། །
en: My motivation is to generate a vast aspiration in those with inferior aspiration.

source: དབང་པོ་ཞུམ་པ་རྣམས་ལ་བརྩོན་འགྲུས་ཆེན་པོའི་ཤུགས་རྣམ་པར་སྤེལ་བའི་སེམས་དང་ལྡན་པའོ། །
en: My motivation is to develop great diligence in those with inferior power.

source: འཁོར་བ་ལ་མངོན་པར་མོས་པ་རྣམས་ལ་འཁོར་བའི་རྒྱུད་ཀྱི་འཁོར་ལོ་ལས་རྣམ་པར་བཟློག་པའི་སེམས་དང་ལྡན་པའོ།
en: My motivation is to turn away from existences in the cycle of saṃsāra those whose aspiration is for saṃsāra.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་མངོན་པར་མོས་པའི་སེམས་ཅན་རྣམས་ལ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ལ་དགོད་པའི་སེམས་དང་ལྡན་པའོ། །
en: My motivation is to establish on the path to omniscience those beings whose aspiration is for the Śrāvakayāna and Pratyeka­buddhayāna.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་དེ་ལྟ་བུའི་སེམས་དང་ཡིད་ལ་བྱ་བར་ལྡན་ལ།
en: “Noble one, those are the motivations and intentions that I have.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྣང་བས་འགྲོ་བ་རྣམ་པར་འདུལ་བའི་སྒོ་འདི་དང་ཡང་ལྡན་པས་སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་མུན་ནག་སྨག་ཏུ་གྱུར་པའི་ནམ་ལ་མི་ནི་ཉལ་བར་གྱུར། འབྱུང་པོའི་ཚོགས་ནི་རྒྱུ་བར་གྱུར། རྐུན་ཆོམ་མང་པོས་ནི་རྒྱས་པར་གྱུར། སེམས་ཅན་མི་བསྲུན་པའི་ཚུལ་ཅན་ནི་ཕྱོགས་སུ་རྒྱུ་བར་གྱུར།
en: I possess the bodhisattva liberation called the gateway to guiding beings through the radiance of the Dharma that eliminates the darkness of all beings.

source: སྤྲིན་སྟུག་པོ་ནག་པོས་ནི་ཀུན་ནས་ཁེབས་པར་གྱུར། དུད་པ་དང་རྡུལ་གྱི་ཚོགས་ཀྱིས་ནི་ཀུན་ནས་འགྲིགས་པར་གྱུར། རྫི་ཆར་མི་བཟད་པས་ནི་རབ་ཏུ་གཏགས་པར་གྱུར། ཟླ་སྐར་གྱི་ཚོགས་ནི་མི་སྣང་བར་གྱུར། མིག་གིས་བྱ་བའི་མཐུ་ནི་མེད་པར་གྱུར་པའི་མུན་པ་ལ་སེམས་ཅན་གང་ཇི་སྙེད་ཅིག་རྒྱ་མཚོ་ལ་སྤྱོད་དམ། ཐང་ལ་སྤྱོད་དམ། རི་ལ་སྤྱོད་དམ། ནགས་ཚལ་གཞན་ན་སྤྱོད་དམ། ཡུལ་གཞན་ན་སྤྱོད་དམ། གྲོང་གཞན་ན་སྤྱོད་དམ། ཕྱོགས་གཞན་ན་སྤྱོད་དམ། ཕྱོགས་མཚམས་གཞན་ན་སྤྱོད་དམ། ལམ་གཞན་ན་སྤྱོད་ཀྱང་རུང་སྟེ།
en: “When beings are in darkness, humans sleep, the hosts of spirits roam around, the numbers of thieves and robbers increase, dangerous beings are active in all directions, thick black clouds cover everything, there is a thick mass of smoke or dust, there is the assault of terrible wind and rain, the moon and stars are hidden, and the eyes are unable to see.

source: རྒྱ་མཚོ་ལ་སྤྱོད་སྤྱོད་པ་ལས་གྲུ་བུབ་པར་གྱུར་པའམ། ཐང་ལ་སྤྱོད་སྤྱོད་པ་ལས་ཉམ་ཉེས་པ་འམ། རི་ལ་སྤྱོད་སྤྱོད་པ་ལས་གཡང་ས་ཆེན་པོར་ལྷུང་བར་གྱུར་པའམ། འབྲོག་དགོན་པ་ལ་སྤྱོད་སྤྱོད་པ་ལས་ཁ་ཟས་ཀྱིས་འཕོངས་པར་གྱུར་པ་འམ། ནགས་ཚལ་ཐིབས་པོར་སྦའི་ཟད་ཟིང་ལ་ཐོགས་སམ། ཚུལ་མ་ཡིན་པའི་ཉམ་ཉེས་ཤིག་ཏུ་གྱུར་ཏམ། ཡུལ་གཞན་ན་སྤྱོད་སྤྱོད་པ་ལས་ཆོམ་པོས་བཅོམ་པའམ། གྲོང་གཞན་ན་སྤྱོད་སྤྱོད་པ་ལས་མི་བསྲུན་པའི་ཚུལ་ཅན་གྱིས་གཙེས་པའམ། ཕྱོགས་གཞན་ན་སྤྱོད་སྤྱོད་པ་ལས་འབྲོག་རྨིས་པའམ། ཕྱོགས་མཚམས་གཞན་ན་སྤྱོད་སྤྱོད་པ་ལས་མགོ་རྨོངས་པའམ། ལམ་གཞན་ན་སྤྱོད་སྤྱོད་པ་ལས་ཉེ་ཞོར་གྱུར་ཀྱང་རུང་སྟེ། རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་སེམས་ཅན་དེ་དག་ལ་ཐབས་སྣ་ཚོགས་ཀྱི་སྒོ་ནས་སྐྱབས་སུ་གྱུར་པར་བྱེད་པ་སྟེ།
en: “Noble one, through various methods I protect those beings in the darkness who are on the ocean, on a plain, on mountains, in a remote wilderness, in a forest, in the countryside, in a town, in a direction, in an intermediate direction, or on a road; those on the ocean whose ship is sinking; those who are in distress; those on the plains; those who are falling down precipices in the mountains; those who have no food or drink in remote wildernesses; those caught in thickets of bamboo in dense forests; those whom calamitous wrongdoing has befallen; those who are being slain by bandits in the countryside; those who perish from ruthless actions in towns; those who are bewildered in the directions; those who are confused in the intermediate directions; and those who encounter disaster on the road.

source: འདི་ལྟར་རྒྱ་མཚོ་ཆེན་པོ་ལ་སྤྱོད་པ་རྣམས་ཀྱི་རླུང་སྤྲིན་ནག་པོ་གཏོར་བ་དང་། ཆུའི་རྙོག་པ་གདང་བ་དང་། རླུང་མི་ཟད་པའི་དཀྱིལ་འཁོར་བཟློག་པ་དང་། རླབས་ཀྱི་ཤུགས་ཆེན་པོ་ཞི་བར་བྱ་བ་དང་། གློག་གི་འཇིགས་པ་ལས་ཐར་བར་བྱ་བ་དང་། ཕྱོགས་བསྟན་པ་དང་། ཆུའི་ལམ་ལེགས་པར་དམིགས་པ་དང་། འགྲམ་བསྟན་པ་དང་། རིན་པོ་ཆེའི་གླིང་དུ་ཕྱིན་པར་བྱ་བའི་ཕྱིར་ལམ་ཡོངས་སུ་བསྟན་ཏེ། ཡོངས་སུ་སྡུད་པའི་གཟུགས་དང་། དེད་དཔོན་གྱི་གཟུགས་དང་། རྟའི་རྒྱལ་པོ་རྔོག་ཆེན་གྱི་གཟུགས་དང་། གླང་པོའི་རྒྱལ་པོའི་གཟུགས་དང་། རུ་སྦལ་གྱི་རྒྱལ་པོའི་གཟུགས་དང་། ལྷ་མ་ཡིན་གྱི་རྒྱལ་པོའི་གཟུགས་དང་།
en: “I do so in this way: for those on the great ocean, I dispel the black winds and clouds, I make troubled waters clear, I dispel the circle of cruel winds, I calm the huge powerful waves, I bring freedom from the danger of lightning, I show the direction to go, I provide the correct course over the waters, I reveal the shore, and I show the way to reach the island of jewels.

source: ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོའི་གཟུགས་དང་། མིའམ་ཅིའི་རྒྱལ་པོའི་གཟུགས་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་རྒྱལ་པོའི་གཟུགས་དང་། རྒྱ་མཚོའི་ལྷའི་གཟུགས་དང་། མཉན་པའི་གཟུགས་ཀྱིས་སྐྱབས་སུ་གྱུར་པར་བྱེད་དོ།
en: I protect them in the form of a gatherer of beings, the form of a merchant leader, the form of a great-maned king of horses, the form of a king of elephants, the form of a king of turtles, the form of a king of the asuras, the form of a king of the garuḍas, the form of a king of the kinnaras, the form of a king of the mahoragas, the form of a deity of the sea, and the form of a ferryman.

source: དགེ་བའི་རྩ་བ་དེ་ཡང་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཐམས་ཅད་ལས་ཡོངས་སུ་བཟློག་པའི་ཕྱིར་སྐྱབས་སུ་གྱུར་པར་ཤོག་ཤིག་ཅེས་ཡོངས་སུ་བསྔོའོ། །ཐང་ལ་སྤྱོད་པའི་སེམས་ཅན་མུན་པ་ཆེན་པོ་ཤིན་ཏུ་གནས་པའི་ནམ་ལ། ས་གཞི་འོད་མདང་། ཚེར་མ་དང་། གསེག་མ་དང་། གྱོ་མོས་གང་བ། སྦྲུལ་གདུག་པ་གཏུམ་པོ་ཤིན་ཏུ་མང་བ། ཐག་ཐུག་དང་། མི་བདེ་བའི་ལམ་ཅན་རྡུལ་དང་ཕྱར་དར་ཤིན་ཏུ་འཐུལ་པ། རྫི་ཆར་དྲག་པོས་གཏགས་པ། ཚ་བ་དང་། གྲང་བའི་སྡུག་བསྔལ་ཡོད་པ། སྦྲུལ་དང་གཅན་ཟན་གྱིས་བག་ཚ་བ་ཡོད་པ། ཐོང་མི་དང་། ཆོམ་པོ་རྒྱུ་བར་གྱུར་པ་ཞིག་ན། མགོ་འཁོར་བར་གྱུར་པའི་སེམས་ཅན་རྣམས་ལ།
en: “I dedicate those roots of merit in this way: ‘May I be a protector of all beings in order to free them from the entire mass of suffering!’

source: ཉི་མའི་གཟུགས་དང་། ཟླ་བའི་གཟུགས་དང་། སྐྱ་རེང་འཆར་བའི་གཟུགས་དང་། སྐར་མདའ་ཆེན་པོའི་གཟུགས་དང་། གློག་གི་ཕྲེང་བ་འབྱུང་བའི་གཟུགས་དང་། རིན་པོ་ཆེའི་འོད་ཀྱི་གཟུགས་དང་། གཟའི་འཁོར་གྱི་གཟུགས་དང་། རྒྱུ་སྐར་དང་སྐར་མའི་ཚོགས་ཀྱི་གཞལ་མེད་ཁང་གི་འོད་ཀྱི་གཟུགས་དང་། ལྷའི་གཟུགས་དང་།
en: “When beings on the plains at night are in great darkness and the ground is covered with bamboo, thorns, pebbles, and potsherds; when there are numerous fierce poisonous snakes, uneven ground, and difficult paths, and when dust and dirt swirl thickly; when there is the assault of fierce wind and rain, being stricken with the suffering of heat and cold, and the fear of snakes and wild beasts; and when bands of murderers and bandits are prowling around, I protect those beings who are confused in the dark, in the form of the sun, in the form of the moon, in the form of the rising of dawn, in the form of great shooting stars, in the form of flashes of lightning, in the form of the light of jewels, in the form of the circle of the planets, in the form of light from the aerial palaces of the constellations and stars, in the form of a deva, and in the form of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་ཀྱིས་སྐྱབས་སུ་གྱུར་པར་བྱེད་དོ། །སེམས་ཀྱང་དགེ་བའི་རྩ་བ་འདིས་ཉོན་མོངས་པའི་མུན་པ་ཐམས་ཅད་རྣམ་པར་བསལ་བའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱབས་སུ་ཤོག་ཤིག་པར་བསྐྱེད་དོ། །
en: “In my mind there arose this aspiration: ‘May I become a refuge for all beings through this root of merit, in order to dispel all the darkness of the kleśas.’

source: རིའི་གཡང་ས་ལ་སྤྱོད་ཅིང་འཆི་བས་འཇིགས་སྐྲག་པ་རྣམས་སྲོག་དབྱུང་བ་དང་། གྲགས་པ་འདོད་པའི་དབང་དུ་གྱུར་པ་དང་། སྙན་པ་དང་། སྒྲའི་རྒྱལ་མཚན་འདོད་པ་དང་། ལོངས་སྤྱོད་ཚོལ་བ་དང་། འདོད་པའི་ཟིལ་གྱིས་ནོན་པ་དང་། ཡོ་བྱད་ཡོངས་སུ་ཚོལ་བ་ལ་བརྩོན་པ་དང་། འཇིག་རྟེན་གྱི་ཕུན་སུམ་ཚོགས་པ་འདོད་ཅིང་བརྩོན་པ་དང་། བུ་དང་ཆུང་མ་གཏོང་མི་ཕོད་པས་ཐོགས་པར་གྱུར་བ་དང་། ལྟ་བའི་ཐིབས་པོར་འཁྱམས་པ་དང་། སྡུག་བསྔལ་བ་དང་། འཇིགས་པ་སྣ་ཚོགས་ཀྱིས་གཙེས་པ་རྣམས་ལ་ཡང་ཐབས་སྣ་ཚོགས་ཀྱི་སྒོ་ནས་སྐྱབས་སུ་གྱུར་བར་བྱེད་དེ། འདི་ལྟར་རིའི་ཕུག་དང་། བྱ་སྐྱིབས་མངོན་པར་བསྒྲུབ་པ་དང་། ཤིང་ཐོག་དང་། རྩ་བ་བཟར་རུང་བ་མངོན་པར་བསྒྲུབ་པ་དང་། ཆུའི་ལམ་དང་། ཆུ་མིག་མངོན་པར་བསྒྲུབ་པ་དང་། ཚ་བ་དང་།
en: “I protect through various methods those on mountain precipices who are afraid of dying and who through clinging to life are under the power of the desire for fame, who desire the banner of words of renown, who have enjoyment as their goal, who are overpowered by desire, who are engaged in the pursuit of the prerequisites for life, who primarily yearn for worldly good fortune, who are tied by affection to children and wife, who are lost in the thicket of views, and who are oppressed by various kinds of suffering and fears.

source: གྲང་བའི་གཉེན་པོ་མངོན་པར་བསྒྲུབ་པ་དང་། ཡང་དག་པའི་ལམ་བསྟན་པ་དང་། ཀ་ལ་པིང་ཀའི་སྒྲ་སྐད་བསྒྲག་པ་དང་། རྨ་བྱའི་རྒྱལ་པོའི་སྐད་འབྱིན་པའི་དབྱངས་དང་། སྨན་འབར་བས་སྣང་བའི་གཟུགས་དང་། རིའི་ལྷའི་འོད་ཀྱི་གཟུགས་དང་།
en: “I do so in this way: by providing them with caves and shelters, by providing them with fruit and roots to eat, by providing them with streams and springs, by providing them with protection against heat and cold, by showing them correct pathways, by the sound of the song of the avadavat, by the sound of the cry of the king of peacocks, through the form of illumination from burning herbs, and through the form of light from the mountain deities.

source: རིའི་ཕུག་དང་སུལ་དང་། ལྟོངས་སུ་རླག་སྟེ། སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱིས་གཙེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་མུན་པའི་རབ་རིབ་རྣམ་པར་བསལ་བ་དང་། སའི་གཞི་མཉམ་པར་མངོན་པར་བསྒྲུབ་པས་སྐྱབས་སུ་གྱུར་པར་བྱེད་དེ།
en: “I become a protector of those in mountain caves, clefts, and chasms who are afflicted by various sufferings, by providing them with level ground, and to dispel the blinding darkness those beings are in.

source: སེམས་ཀྱང་ཇི་ལྟར་བདག་གིས་སེམས་ཅན་རི་ལ་སྤྱོད་པ་འདི་དག་ཡོངས་སུ་བསྐྱབས་པ་དེ་བཞིན་དུ་འཁོར་བའི་རིའི་ལམ་རྒྱུད་གཡང་ས་ལ་གནས་ཤིང་རྒ་ཤིའི་གདོན་གྱིས་ཟིན་པ་དེ་དག་གི་སྐྱབས་སུའང་བདག་འགྱུར་བར་ཤོག་ཤིག་པར་བསྐྱེད་དོ། །ནགས་ཚལ་ཐིབས་པོའི་དྲ་བས་ཐོགས་པའི་སེམས་ཅན་མཚན་མོ་མུན་པའི་མུན་ནག་གིས་ཆོད་དེ། ཤིང་དང་། ཤིང་འཕྲན་འཛིངས་པའི་གསེབ་ཤིན་ཏུ་ཉམ་ང་བ་དང་། ཆུ་དང་།
en: “In my mind there arises this thought: ‘Just as I have protected these beings who are in the mountains, may I become a protector for those who have fallen into the chasms of the mountain of saṃsāra and have been seized by the demons of old age and death.’

source: རྩྭ་དང་། སྤོང་པོ་དང་། འཁྲི་ཤིང་གིས་ལམ་ཆོད་པ་དང་། ཤིང་དང་ཤིང་ཕྲན་སྣ་ཚོགས་ཀྱི་ནགས་ཚལ་ཐིབས་པའི་ནང་དུ་ཕྱིན་ཏེ། སྟག་གི་སྒྲ་ཐོས་པས་སྐྲག་པའི་སྙིང་ཅན་དོན་མ་གྲུབ་པས། སེམས་འཁྲུགས་པར་གྱུར་པ་དང་།
en: “I become someone who shows the correct path to follow for those beings who are trapped in the net of a dense forest and blinded by the darkness of the night; who are in distress within a tangle of trees and shrubs; whose path is blocked by grass, rivers, thorns, trees, and vines; who have entered a dense forest of numerous trees and vines; who have fear in their hearts on hearing the roaring of tigers; who are distressed at being unable to accomplish their goals; who are afflicted by various dangers, misfortunes, and troubles; and who do not know the way out of a thick forest.

source: འཇིགས་པ་དང་འཚེ་བ་དང་། མི་དགའ་བ་སྣ་ཚོགས་ཀྱིས་ཉམས་མི་བདེ་བ་ནགས་ཚལ་སྟུག་པ་ནས་འབྱུང་བའི་ཕྱོགས་མི་ཤེས་པ་རྣམས་ལ། ཁོ་མོ་ནི་བདེ་བར་འགྲོ་བའི་ལམ་ཡོངས་སུ་སྟོན་པ་བྱེད་དེ། སེམས་ཀྱང་འདི་ལྟར་དགེ་བའི་རྩ་བ་འདིས་སེམས་ཅན་ལྟ་བའི་ཐིབས་པོ་སྣ་ཚོགས་ལ་གནས་པ། སྲེད་པའི་དྲ་བས་འཁྲིས་པར་གྱུར་པ།
en: “In my mind there arises this thought: ‘Through this root of merit, may I free from all suffering those beings who are in the thicket of various views, who are caught in the net of craving, and who are oppressed by the various sufferings and dangers of saṃsāra.’

source: འཁོར་བའི་སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱིས་གཙེས་པ་རྣམས་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཡོངས་སུ་འགྲེལ་བར་ཤོག་ཤིག་པར་བསྐྱེད་དོ། །འབྲོག་དགོན་པ་ལ་སྤྱོད་པའི་སེམས་ཅན་མུན་པའི་ནང་ན་འཐོམས་པ་རྣམས་ཀྱང་ཐབས་ཀྱི་སྒོ་སྣ་ཚོགས་ཀྱིས་བདེ་བ་ཡོངས་སུ་བསྐྱེད་ཅིང་ལམ་བསྟན་ཏེ།
en: “Through various methods I bring happiness to those beings who are confused in darkness in remote wildernesses.

source: དེ་དག་འཇིགས་པ་མེད་པ་དང་། བདེ་བ་ལ་རབ་ཏུ་བཀོད་ནས།
en: I show them the path and bring them to a safe and pleasant place.
